app/views/users/likes.html.erb

      <!-- 変数postを定義 -->
      <% post = Post.find_by(id: like.post_id) %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]