app/controllers/posts_controller.rb

  def index
    # Post.allにorderメソッドを用いて、投稿を順に並べる(昇順（:asc）と降順（:desc)
    @posts = Post.all.order(created_at: :desc)
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC

  def show
    @post = Post.find_by(id: params[:id])
    @user = @post.user
    @likes_count = Like.where(post_id: @post.id).count
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 1]]

  def create
    @post = Post.new(content: params[:content],user_id: @current_user.id)
    if @post.save
---
INSERT INTO "posts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "１１１１"], ["created_at", "2022-12-03 18:45:00.460566"], ["updated_at", "2022-12-03 18:45:00.460566"], ["user_id", 1]]