app/controllers/users_controller.rb

  def create
    @user = User.new(name: params[:name], email: params[:email],
      image_name: "admin_user.jpg",password: params[:password])
    # 保存が成功したかどうかで条件分岐
    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "image_name", "password") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @user = User.find_by(id: params[:id])
    @user.name = params[:name]
    @user.email = params[:email]

    if params[:image]
      @user.image_name = "#{@user.id}.jpg"
      image = params[:image]
      File.binwrite("public/user_images/#{@user.image_name}", image.read)
    end

    if @user.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "image_name" = ? WHERE "users"."id" = ?  [["updated_at", "2022-12-03 18:36:48.594985"], ["image_name", "1.jpg"], ["id", 1]]